задачник_едт/src/Documents/Проект/Проект.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Проект</name>
  <comment>Проектные работы</comment>
  <posting>Deny</posting>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

задачник_едт/src/Documents/ЭтапПроекта/ЭтапПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭтапПроекта</name>
  <registerRecords>AccumulationRegister.Себестоимость</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>DocumentRef.Проект</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеЭтапа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

задачник_едт/src/Documents/Проект/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	//Пересчет суммы документа
	//TODO: Исправить пересчет суммы при записи документа проект
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЭтапПроекта.ПлановаяСтоимость
		|ИЗ
		|	Документ.ЭтапПроекта КАК ЭтапПроекта
		|ГДЕ
		|	ЭтапПроекта.Проект = &Проект
		|	И
		|	НЕ ЭтапПроекта.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Проект", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Сумма = 0;
	Пока Выборка.Следующий() Цикл
		Сумма = Сумма + Выборка.ПлановаяСтоимость;
	КонецЦикла;
	
КонецПроцедуры
